Sanskar-Dwivedi/SurakshaMarg-RealOne/hardware/wokwi_esp32/gaukavach_esp32.ino
/*
 * GauKavach - bench governor, ESP32
 * ---------------------------------
 * Same rule set as the Uno sketch, plus the one thing an Uno physically
 * cannot do: a RAMPED burst envelope.
 *
 * Arduino tone() emits a hard-gated square wave. Our own spectrum analysis
 * (gaukavach spectrum) says that is the wrong waveform: the rectangular gate
 * splatters broadband switching energy into the audible band, so the device
 * clicks at every activation even though the carrier is ultrasonic. OSHA
 * documents exactly this failure mode.
 *
 * The ESP32's LEDC peripheral gives independent control of frequency and duty,
 * so the duty cycle can be ramped up and down with a raised-cosine profile.
 * That is the hardware expression of emitter.py's _raised_cosine_envelope().
 *
 * Honest scope, unchanged from the Uno sketch:
 *   - no calibrated microphone is attached, so this rig makes NO dB claim
 *   - duty ramping shapes the drive envelope; it is not a substitute for
 *     measuring the acoustic output of a real transducer
 *   - a 40 kHz ranging element is the wrong part (above the 35 kHz cattle
 *     audiogram endpoint) and stands in for the signal chain only
 *
 * ARDUINO IDE SETTINGS
 *   Tools > Board            ESP32 Arduino > ESP32 Dev Module
 *   Tools > Upload Speed     921600  (drop to 115200 if uploads fail)
 *   Tools > Port             whatever COM port appears when the board is plugged in
 *   No libraries to install: everything used here ships with the ESP32 core.
 * If the port never appears, it is the CP2102 / CH340 USB-serial driver, not
 * the sketch. If upload stalls at "Connecting...", hold BOOT while it starts.
 *
 * The LEDC API changed between Arduino-ESP32 core 2.x and 3.x: ledcSetup() and
 * ledcAttachPin() were removed, and ledcWrite() now takes a PIN rather than a
 * channel. Both Wokwi and this machine's IDE are on core 3.x; the wrappers
 * below still cover 2.x so the sketch survives an older install elsewhere.
 *
 * REAL HARDWARE vs THE SIMULATOR
 * A simulator hands you a clean sensor reading, a clean ADC and a bounce-free
 * button. A breadboard hands you none of those, and each one has a specific
 * way of ruining a live demo, so each is conditioned below: see 'input
 * conditioning'. The governor logic itself is untouched - the whole point is
 * that the rules are the same everywhere they are stated.
 */

/* ---------------- pins ---------------- */
const int PIN_TRIG      = 13;
const int PIN_ECHO      = 39;   // VN. NOT 12: GPIO12 is a strapping pin (MTDI)
const int PIN_EMIT      = 25;   // LEDC output -> 220R -> transistor -> transducer

const int LED_PERMIT    = 26;   // green
const int LED_REFUSE    = 27;   // red
const int LED_ESCALATE  = 14;   // amber
const int LED_ARMED     = 2;    // on-board blue

const int BTN_PERSON    = 32;
const int BTN_NONTARGET = 33;
const int BTN_ESTOP     = 35;   // input-only pin, needs an external pull-up

/* Pin choices avoid the ESP32 strapping pins 0, 2, 5, 12 and 15, which are
 * sampled at reset. GPIO2 is the exception: it is the on-board LED, driven as
 * an output only, which is the standard and safe use of it. */
const int POT_GROUP     = 34;   // ADC1, input-only

/* ------------- what is actually fitted -------------
 * Set to 0 when no potentiometer is on the board.
 *
 * This matters more than it looks. GPIO34 is input-only with no internal pull
 * anywhere in the silicon, so an unfitted pot does not read zero - it floats,
 * and the governor sees a herd size that wanders between 1 and 8 on its own.
 * Every refusal it then produces is real, correctly reasoned, and based on a
 * number nobody chose. That is the worst failure this rig can have, because
 * it looks exactly like the system working.
 *
 * With HAVE_POT 0 the pin is never read. Group size comes from the serial
 * console instead: type g5 and press enter. Say so when you demo it.
 */
#define HAVE_POT 0

/* Set to 0 when the E-stop button is not fitted, or is wired in a way that
 * reads permanently closed. Two legs on the same side of a tactile switch are
 * already joined inside it, so that mistake grounds the pin forever and the
 * governor is inhibited from the moment it boots.
 *
 * Turning this off does NOT remove the emergency stop - the console 'e'
 * command still latches it, and every other veto is untouched. It removes a
 * pin that is lying. But the rig must then never be described as having a
 * wired safety interlock, so it says so at boot, every boot. */
#define HAVE_ESTOP 0

/* Set to 0 when no HC-SR04 is fitted or it returns no echo. Distance then
 * comes from the console: type d80 for 80 cm. The governor cannot tell the
 * difference, because it only ever sees a distance - which is exactly why you
 * have to say out loud that the distance input is being typed.
 *
 * Now 1: on 5 V from VIN through a rail, with the 1k/2k divider restored, the
 * module answers 344 of 355 pings across 16-105 cm. It had been silent on 3.3 V
 * while still holding ECHO low - powered enough to drive the line, not enough
 * to fire the transmitter. Distance is sensed again; only the group size and
 * the emergency stop remain typed. */
#define HAVE_SENSOR 1

/* Two colours carry the four states, with escalation blinking rather than
 * owning a third colour. All three lamps on this rig now work - see
 * FAR_LAMP_MODE below, which gives the third one a job of its own. */
#define TWO_LAMP_MODE 1

/* Set to 1 when exactly one status LED works. Not the case here any more; kept
 * because a rig can always lose a lamp an hour before it is needed.
 *
 * One lamp still carries three states, by rate rather than by colour: solid
 * while emitting, a slow pulse while refusing, a fast flutter once it has
 * given up and asked for a human. Dark means nothing is there.
 *
 * Solid-for-emitting is the right way round. This lamp is off almost all of
 * the time, and that is the argument, not a limitation of it. */
#define ONE_LAMP_MODE 0
#if TWO_LAMP_MODE || ONE_LAMP_MODE
/* Measured with count_lamp, each pin blinking its own number: green on GPIO14,
 * red on GPIO27, and yellow on GPIO26 once it was wired.
 *
 * Worth recording why that took so long. The first mapping was taken while
 * GPIO26 and GPIO27 were shorted together in one breadboard column, so driving
 * either lit the single LED that existed, and GPIO26 looked like the red lamp.
 * Once the short was fixed that reading was false, and every later test drove a
 * pin with nothing on it. Measurements taken through a fault do not survive the
 * fix - re-measure after every repair, including this comment. */
const int LAMP_GO   = 14;      // green: permitted
const int LAMP_STOP = 27;      // red: refused, and blinking for escalated
const int LAMP_ONE  = 14;
#endif

