Sanskar-Dwivedi/SurakshaMarg-RealOne/hardware/wokwi_esp32/gaukavach_esp32.ino
#if HAVE_SENSOR
  float cm = readRangeCm();
#else
  float cm = simDistanceCm;
#endif
  bool  seen = (cm > 0 && cm < SEEN_MAX_CM);
  float metres = seen ? (cm / DESK_SCALE) : 999.0f;

  if (state == EMITTING && (now - emitStartedAt) >= scaled(MAX_ACTIVATION_MS)) {
    emitStop("WATCHDOG max activation");
    state = COOLDOWN;
  }

  if (!seen) {
    if (state == EMITTING) emitStop("target lost");
    if (state != INHIBITED) state = IDLE;
    attempts = 0; incidentStart = 0;
    leds(false, false, false);
    return;
  }

  if (incidentStart == 0) {
    incidentStart = now;
    Serial.printf("DETECTION at %.1f m (scaled)\n", metres);
  }

  const char *deny = nullptr;
  if (doNotEmit)                     deny = "animal is on the do-not-emit list";
  else if (person)                   deny = "a person is inside the exposure cone";
  else if (nonTarget)                deny = "a non-target species is inside the cone";
  else if (group > MAX_GROUP)        deny = "group large enough that a startle could cascade";
  else if (metres > RANGE_MAX_M)   { deny = "beyond the acoustic envelope";
                                     farRefusal = true; }
  else if (metres <= LINE_M)         deny = "already at the carriageway - fleeing would cross it";
  else if (state == COOLDOWN &&
           (now - lastEmissionEnd) < scaled(MIN_SILENCE_MS))
                                     deny = "enforced quiet period";

  bool timedOut = (now - incidentStart) > scaled(ESCALATE_AFTER_MS);
  if (state != EMITTING && (attempts >= MAX_ATTEMPTS || timedOut)) {
    if (state != ESCALATED) {
      emitStop("escalating");
      Serial.println("  ESCALATED -> traffic warning + human dispatch");
      Serial.println("  (acoustic cues are not stock-proof; the system stops)");
      state = ESCALATED;
    }
    leds(false, false, true);
    return;
  }

  if (deny != nullptr) {
    if (state == EMITTING) emitStop(deny);
    state = (state == COOLDOWN) ? COOLDOWN : TRACKING;
    leds(false, true, false);
    if (now - lastPrint > 800) {
      Serial.printf("REFUSED @ %.1f m  group=%d  -> %s\n", metres, group, deny);
      lastPrint = now;
    }
    return;
  }

  if (state != EMITTING) {
    state = EMITTING;
    emitStartedAt = millis();
    attempts++;
    Serial.printf("PERMITTED @ %.1f m  attempt %d/%d  carrier %.1f kHz  ramped %d ms\n",
                  metres, attempts, MAX_ATTEMPTS, CARRIER_HZ / 1000.0, RAMP_MS);
    Serial.printf("  budget used %lu / %lu ms\n",
                  (unsigned long)exposureUsedMs, (unsigned long)scaled(DAILY_BUDGET_MS));
    emitStart();
  }
  leds(true, false, false);
}
